agency-services-transunion/src/examples/authreq.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:con="https://consumerconnectws.tui.transunion.com/"
  xmlns:data="https://consumerconnectws.tui.transunion.com/data">
  <soapenv:Header/>
  <soapenv:Body>
    <con:GetAuthenticationQuestions>
      <con:request>
        <data:AccountCode>123456789</data:AccountCode>
        <data:AccountName>CC2BraveCredit</data:AccountName>
        <data:AdditionalInputs>
          <data:Data>
            <data:Name>CreditReportVersion</data:Name>
            <data:Value>7</data:Value>
          </data:Data>
        </data:AdditionalInputs>
        <data:RequestKey>076b9ae3-9a5c-45ea-8b76-4377168e1650</data:RequestKey>
        <data:ClientKey>22545f5a-3a68-42f2-8be9-9d639edbb958</data:ClientKey>
        <data:Customer>
          <data:CurrentAddress>
            <data:AddressLine1>1202 Main St</data:AddressLine1>
            <data:AddressLine2>null</data:AddressLine2>
            <data:City>Fort Wayne</data:City>
            <data:State>IN</data:State>
            <data:Zipcode>46808</data:Zipcode>
          </data:CurrentAddress>
          <data:DateOfBirth>2021-06-01</data:DateOfBirth>
          <data:FullName>
            <data:FirstName>Charles</data:FirstName>
            <data:LastName>FAULCON</data:LastName>
            <data:MiddleName>L</data:MiddleName>
            <data:Prefix>null</data:Prefix>
            <data:Suffix>null</data:Suffix>
          </data:FullName>
          <data:PhoneNumber>undefined</data:PhoneNumber>
          <data:PreviousAddress>
            <data:AddressLine1>null</data:AddressLine1>
            <data:AddressLine2>null</data:AddressLine2>
            <data:City>null</data:City>
            <data:State>null</data:State>
            <data:Zipcode>null</data:Zipcode>
          </data:PreviousAddress>
          <data:Ssn>000003657</data:Ssn>
        </data:Customer>
        <data:Email>undefined</data:Email>
        <data:Language>undefined</data:Language>
        <data:ServiceBundleCode>CC2BraveCreditAuthentication</data:ServiceBundleCode>
        <data:TrustSessionId>undefined</data:TrustSessionId>
      </con:request>
    </con:GetAuthenticationQuestions>
  </soapenv:Body>
</soapenv:Envelope>